УТ/src/InformationRegisters/CRM_НастройкиОбменаСB2BПорталом/CRM_НастройкиОбменаСB2BПорталом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиОбменаСB2BПорталом</name>
  <resources>
    <name>EmailКонтактов</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипОтношенийПартнеров</name>
    <type>
      <types>CatalogRef.CRM_ТипыОтношений</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонУведомленияОРегистрации</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныРассылки</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонУведомленияОбИзменениях</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныРассылки</types>
    </type>
  </resources>
  <resources>
    <name>СценарийПоддержки</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПолученияЗаявок</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </resources>
  <resources>
    <name>КаналРекламногоВоздействия</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникРекламногоВоздействия</name>
    <type>
      <types>Characteristic.КаналыРекламныхВоздействий</types>
    </type>
  </resources>
</mdclass:InformationRegister>

УТ/src/Documents/CRM_Телемаркетинг/CRM_Телемаркетинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Телемаркетинг</name>
  <basedOn>Catalog.МаркетинговыеМероприятия</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимодействия</name>
    <type>
      <types>CatalogRef.CRM_ВидыВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Опрос</name>
    <type>
      <types>DocumentRef.НазначениеОпросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Шаблон</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗаказчик</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.CRM_ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПродажи</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицоСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеДозвонились</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Интерес</name>
      <type>
        <types>DocumentRef.CRM_Интерес</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелефонСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеЗаказчик</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Звонок</name>
      <comment>Телефонный звонок</comment>
      <type>
        <types>DocumentRef.ТелефонныйЗвонок</types>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.CRM_ПричиныОтказовПриОбзвоне</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗвонков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерезвонитьПозднее</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Взаимодействие</name>
      <type>
        <types>DocumentRef.CRM_Взаимодействие</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/InformationRegisters/CRM_НастройкиОбменаСB2BПорталом/Forms/Настройка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьНастройкиОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийЭлемент = Элементы.ИспользоватьОбмен;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьнастройкиОбмена();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиОбмена()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Узел = ПланыОбмена.CRM_ОбменB2BПортал.НайтиПоКоду("01");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Узел);
	URLПортала = Узел.URL;
	
	Если Не ЗначениеЗаполнено(EmailКонтактов) Тогда
		EmailКонтактов = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
	КонецЕсли;
	Если Таймаут = 0 Тогда
		Таймаут = 3;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиОбменаСB2BПорталом.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, МенеджерЗаписи);
	КонецЕсли;
	
	ИспользоватьОбмен = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьОбменB2BПортал");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОбмена()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Узел = ПланыОбмена.CRM_ОбменB2BПортал.НайтиПоКоду("01");
	
	УзелОбъект = Узел.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(УзелОбъект, ЭтотОбъект);
	УзелОбъект.URL = URLПортала;
	УзелОбъект.Записать();
	
	МенеджерЗаписи = РегистрыСведений.CRM_НастройкиОбменаСB2BПорталом.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтотОбъект);
	МенеджерЗаписи.Записать();
	
	ИспользоватьОбменПрежнееЗначение = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьОбменB2BПортал");
	Если ИспользоватьОбмен <> ИспользоватьОбменПрежнееЗначение Тогда
		Константы.CRM_ИспользоватьОбменB2BПортал.Установить(ИспользоватьОбмен);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСПочтовымиСообщениямиКлиент.ПолеПароляНачалоВыбора(Элемент, Пароль, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
// Процедура определяет доступность первичного интереса.
//
// Параметры:
//	Нет.
//
Процедура ДоступностьКаналаИИсточникаОбращения()
      
	Если ЗначениеЗаполнено(КаналРекламногоВоздействия) И НЕ ЗначениеЗаполнено(ИсточникРекламногоВоздействия) Тогда
		Элементы.ИсточникРекламногоВоздействия.АвтоОтметкаНезаполненного	= Истина;
		Элементы.ИсточникРекламногоВоздействия.ОтметкаНезаполненного		= Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаналРекламногоВоздействия)
		 И (ТипПВХ(КаналРекламногоВоздействия) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника")) Тогда
		Элементы.ИсточникРекламногоВоздействия.АвтоОтметкаНезаполненного	= Ложь;
		Элементы.ИсточникРекламногоВоздействия.ОтметкаНезаполненного		= Ложь;
	КонецЕсли;
	
КонецПроцедуры // ДоступностьКаналаИИсточникаОбращения()

&НаСервереБезКонтекста
// Функция возвращает тип значения элемента ПВХ.
//
// Параметры:
//	ПВХСсылкка	- ЛюбаяСсылка	- Ссылка на элемент ПВХ.
//
// Возвращаемое значение:
//	Тип	- Тип значения элемента ПВХ.
//
Функция ТипПВХ(ПВХСсылка)
	Возврат ТипЗнч(ПВХСсылка.ТипЗначения.ПривестиЗначение());
КонецФункции // ТипПВХ()

&НаКлиенте
Процедура КаналРекламногоВзаимодействияПриИзменении(Элемент)
	ДоступностьКаналаИИсточникаОбращения();
	
	Если ИсточникРекламногоВоздействия = Неопределено ИЛИ ИсточникРекламногоВоздействия.Пустая() Тогда
		Элементы.ИсточникРекламногоВоздействия.ПодсказкаВвода = Строка(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(КаналРекламногоВоздействия,
			 "ТипЗначения"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаналРекламногоВоздействия)
		 И ТипПВХ(КаналРекламногоВоздействия) <> Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.ИсточникРекламногоВоздействия.Видимость = Истина;
		Элементы.ИсточникРекламногоВоздействия.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ИсточникРекламногоВоздействия.Видимость = Ложь;
		Элементы.ИсточникРекламногоВоздействия.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаналРекламногоВоздействия) И Не ЗначениеЗаполнено(ИсточникРекламногоВоздействия) Тогда
		Элементы.ИсточникРекламногоВоздействия.АвтоОтметкаНезаполненного = Истина;
		Элементы.ИсточникРекламногоВоздействия.ОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаналРекламногоВоздействия)	И ТипПВХ(КаналРекламногоВоздействия) = Тип("ПеречислениеСсылка.CRM_КаналыБезУказанияИсточника") Тогда
		Элементы.ИсточникРекламногоВоздействия.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ИсточникРекламногоВоздействия.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	//Подключаемый_ПриИзмененииРеквизита(Элемент);
	ИсточникРекламногоВоздействия = Неопределено;
	//Подключаемый_ПриИзмененииРеквизита(Элементы.ИсточникРекламногоВоздействия);

КонецПроцедуры

&НаКлиенте
Процедура КаналРекламногоВзаимодействияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",		Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока",	КаналРекламногоВоздействия);
	ОткрытьФорму("ПланВидовХарактеристик.КаналыРекламныхВоздействий.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ИсточникРекламногоВоздействияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		Если ЗначениеЗаполнено(КаналРекламногоВоздействия) Тогда
		
		Если ТипПВХ(КаналРекламногоВоздействия)= Тип("СправочникСсылка.МаркетинговыеМероприятия") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора",		Истина);
			ПараметрыФормы.Вставить("ТекущаяСтрока",	ИсточникРекламногоВоздействия);
			ПараметрыФормы.Вставить("СкрытьПодменюВид",	Истина);
			ФормаВыбора = ПолучитьФорму("Справочник.МаркетинговыеМероприятия.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
			ЭлементОтбора					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Завершено");
			ЭлементОтбора.ПравоеЗначение	= Истина;
			ЭлементОтбора.Использование		= Истина;
			
			ГруппаОтбора					= ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы			= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ЭлементОтбора					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ДатаОкончания");
			ЭлементОтбора.ПравоеЗначение	= Дата("00010101");
			ЭлементОтбора.Использование		= Истина;
			ЭлементОтбора					= ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("CRM_ДатаАктуальности");
			ЭлементОтбора.ПравоеЗначение	= НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
			ЭлементОтбора.Использование		= Истина;
			ФормаВыбора.Открыть();
			
		ИначеЕсли ТипПВХ(КаналРекламногоВоздействия) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
			СтандартнаяОбработка	= Ложь;
			ДополнительныеПараметры	= Новый Структура("Элемент", Элемент);
			ОписаниеВыбораПартнера	= Новый ОписаниеОповещения("ОбработкаВыбораПартнераИсточника", ЭтотОбъект,
				 ДополнительныеПараметры);
			ПараметрыФормы			= Новый Структура;
			Если ЗначениеЗаполнено(ИсточникРекламногоВоздействия)
				 И (ТипЗнч(ИсточникРекламногоВоздействия) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров")) Тогда
				ПараметрыФормы.Вставить("ТекущаяСтрока",
					 CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ИсточникРекламногоВоздействия,
					 "Владелец"));
			КонецЕсли;
			ОткрытьФорму("Справочник.Партнеры.ФормаВыбора", ПараметрыФормы, Элемент, ,
				 ВариантОткрытияОкна.ОтдельноеОкно, ,
				 ОписаниеВыбораПартнера);
			
		ИначеЕсли ТипПВХ(КаналРекламногоВоздействия) = Тип("СправочникСсылка.Партнеры") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора",		Истина);
			ПараметрыФормы.Вставить("ТекущаяСтрока",	ИсточникРекламногоВоздействия);
			ФормаВыбора = ПолучитьФорму("Справочник.Партнеры.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
			ФормаВыбора.Открыть();
			
		ИначеЕсли ТипПВХ(КаналРекламногоВоздействия) = Тип("СправочникСсылка.Пользователи") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора",		Истина);
			ПараметрыФормы.Вставить("ТекущаяСтрока",	ИсточникРекламногоВоздействия);
			ФормаВыбора = ПолучитьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
			ФормаВыбора.Открыть();
			
		ИначеЕсли ТипПВХ(КаналРекламногоВоздействия) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора",		Истина);
			ПараметрыФормы.Вставить("ТекущаяСтрока",	ИсточникРекламногоВоздействия);
			ФормаВыбора = ПолучитьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
			ФормаВыбора.Открыть();
			
		ИначеЕсли ТипПВХ(КаналРекламногоВоздействия) = Тип("ДокументСсылка.CRM_Телемаркетинг") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора",		Истина);
			ПараметрыФормы.Вставить("ТекущаяСтрока",	ИсточникРекламногоВоздействия);
			ФормаВыбора = ПолучитьФорму("Документ.CRM_Телемаркетинг.ФормаВыбора", ПараметрыФормы, Элемент, ЭтотОбъект);
			ФормаВыбора.Открыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДоступностьКаналаИИсточникаОбращения();

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик выбора партнера - владельца.
//
// Параметры:
//	РезультатЗакрытия		- СправочникСсылка	- Владелец контактных лиц.
//	ДополнительныеПараметры	- Структура			- Структура дополнительных параметров.
//
Процедура ОбработкаВыбораПартнераИсточника(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ПараметрыФормы = Новый Структура;
	Если РезультатЗакрытия <> Неопределено Тогда 
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", РезультатЗакрытия));
	КонецЕсли;
	ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаВыбора", ПараметрыФормы,
		 ДополнительныеПараметры.Элемент, ,
		 ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры // ОбработкаВыбораПартнераИсточника()

#КонецОбласти
